In [7]:
import pandas as pd
from sklearn.model_selection import train_test_split
df=pd.read_csv("Book3.csv")
x=df[['X']] [[]]to make x 2d means dataframe to insert in linear regression bcz it gives error if we pass 1d array
y=df['Y']
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=10)
x_train

     X
6   22
8   19
2   18
10  24
5   22
11  11
14  23
1   23
0   15
4   24
13  16
9   16

In [8]:
from sklearn.linear_model import LinearRegression
lr=LinearRegression()
lr

LinearRegression()

In [11]:
#here y is target column means which is to be predicted
# and x is features means input data on which we have to train
#so x can have multipl values but y has only one value 
lr.fit(x_train,y_train)

LinearRegression()

In [12]:
y_pred=lr.predict(x_test)
print(y_pred)
print(y_test)

[63.30935252 54.96402878 65.39568345]
3     60
7     63
12    59
Name: Y, dtype: int64

In [19]:
x_pred=lr.predict(x_test)
print(x_pred)
print(x_test)

[63.30935252 54.96402878 65.39568345]
     X
3   23
7   19
12  24

In [21]:
import numpy as np
np.float = np.float64

In [28]:
from sklearn.metrics import mean_absolute_error,mean_squared_error,r2_score
# mAE=(1/n)E|Yact-Ypred|
# mSE=(1/n)E(Yact-Ypred)^2
print(mean_absolute_error(y_pred,y_test))
print(mean_squared_error(y_pred,y_test))
print(r2_score(y_pred,y_test))
print(lr.predict([[24]]))
print(lr.coef_) # (m)slope
print(lr.intercept_)# value of c in y=Mx+C

5.913669064748201
38.811138139847834
-0.9106590793273315
[65.39568345]
[2.08633094]
15.323741007194272

In [29]:
data = pd.DataFrame({'length':[18,20,10,12,18,11],
                    'width':[20,20,10,11,19,10],
                    'type':['Big','Big','Normal','Big','Normal','Big']})
data

   length  width    type
0      18     20     Big
1      20     20     Big
2      10     10  Normal
3      12     11     Big
4      18     19  Normal
5      11     10     Big

In [30]:
data['Area']=data['length']*data['width']
data

   length  width    type  Area
0      18     20     Big   360
1      20     20     Big   400
2      10     10  Normal   100
3      12     11     Big   132
4      18     19  Normal   342
5      11     10     Big   110

In [31]:
df=pd.get_dummies(data=data)
df

   length  width  Area  type_Big  type_Normal
0      18     20   360         1            0
1      20     20   400         1            0
2      10     10   100         0            1
3      12     11   132         1            0
4      18     19   342         0            1
5      11     10   110         1            0

In [32]:
import pandas as pd
df=pd.DataFrame({'Area':[4720,2430,4368,3969,6142,7912],
                'price':[2360000,1215000,2184000,1984500,3071000,3956000]})
df

   Area    price
0  4720  2360000
1  2430  1215000
2  4368  2184000
3  3969  1984500
4  6142  3071000
5  7912  3956000

In [33]:
df['price']=np.where(df['price']>3000000,'High',np.where(df['price']<2000000,'Low','Medium'))
df

   Area   price
0  4720  Medium
1  2430     Low
2  4368  Medium
3  3969     Low
4  6142    High
5  7912    High

In [37]:
df=pd.read_csv('Marksheet.csv')
df=df.loc[df['Roll No']==106]
df

,sr no,Branch,Enrolment No,Name,Roll No,Div,Mentor Name,TEST-1 MARKS,TEST-2 MARKS,TEST-3 MARKS,TEST-4 MARKS
27,28,CE,2.300220e+13,CHUDASAMA ASHUTOSH JASVANTBHAI,106,A3,DVP,20.0,23.0,13.5,20

In [42]:
import pandas as pd
import numpy as np
df=pd.read_csv("Marksheet.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 302 entries, 0 to 301
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sr no         302 non-null    int64
 1   Branch        302 non-null    object
 2   Enrolment No  302 non-null    float64
 3   Name          302 non-null    object
 4   Roll No       302 non-null    int64
 5   Div           302 non-null    object
 6   Mentor Name   301 non-null    object
 7   TEST-1 MARKS  302 non-null    float64
 8   TEST-2 MARKS  302 non-null    float64
 9   TEST-3 MARKS  302 non-null    object
 10  TEST-4 MARKS  302 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 26.1+ KB

In [44]:
df.loc[df['TEST-3 MARKS']=='AB','TEST-3 MARKS']=0
df.loc[df['TEST-4 MARKS']=='AB','TEST-4 MARKS']=0
df.info()
df['TEST-3 MARKS']=df['TEST-3 MARKS'].astype('float64')
df['TEST-4 MARKS']=df['TEST-4 MARKS'].astype('float64')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 302 entries, 0 to 301
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sr no         302 non-null    int64
 1   Branch        302 non-null    object
 2   Enrolment No  302 non-null    float64
 3   Name          302 non-null    object
 4   Roll No       302 non-null    int64
 5   Div           302 non-null    object
 6   Mentor Name   301 non-null    object
 7   TEST-1 MARKS  302 non-null    float64
 8   TEST-2 MARKS  302 non-null    float64
 9   TEST-3 MARKS  302 non-null    object
 10  TEST-4 MARKS  302 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 26.1+ KB

In [46]:
df['Total Marks']=df['TEST-1 MARKS']+df['TEST-2 MARKS']+df['TEST-3 MARKS']+df['TEST-4 MARKS']

In [47]:
for i in df['Div'].unique():
    print(i,df.loc[df['Div']==i,'Total Marks'].mean())

A4 74.38571428571429
A3 79.45714285714286
A5 70.55714285714286
A2 82.94594594594595
A1 92.1891891891892
A6 58.43055555555556
A7 49.86363636363637
A8 78.41071428571429
A9 57.84615384615385